<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><meta name="viewport" content="width=device-width, initial-scale=0.8"/><title>3.3&nbsp;巧克力木棒</title><link rel="stylesheet" type="text/css" href="scribble.css" title="default"/><link rel="stylesheet" type="text/css" href="manual-style.css" title="default"/><link rel="stylesheet" type="text/css" href="manual-racket.css" title="default"/><link rel="stylesheet" type="text/css" href="custom.css" title="default"/><script type="text/javascript" src="scribble-common.js"></script><script type="text/javascript" src="manual-racket.js"></script><!--[if IE 6]><style type="text/css">.SIEHidden { overflow: hidden; }</style><![endif]--><link rel="shortcut icon" type="image/png" href="https://res.cloudinary.com/kdr2/image/upload/img-kdr2-com/main/k-favicon.png"/><script type="text/x-mathjax-config">MathJax.Hub.Config({
    jax: ["input/TeX","output/HTML-CSS"],
    displayAlign: "left"
})</script></head><body id="scribble-racket-lang-org"><div class="tocset"><div class="tocview"><div class="tocviewlist tocviewlisttopspace"><div class="tocviewtitle"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_0&quot;);">&#9658;</a></td><td></td><td><a href="index.html" class="tocviewlink" data-pltdoc="x">He who doesn&rsquo;t blend in</a></td></tr></table></div><div class="tocviewsublisttop" style="display: none;" id="tocview_0"><table cellspacing="0" cellpadding="0"><tr><td align="right">1&nbsp;</td><td><a href="preface.html" class="tocviewlink" data-pltdoc="x">Preface</a></td></tr><tr><td align="right">2&nbsp;</td><td><a href="whims.html" class="tocviewlink" data-pltdoc="x">Spark, whims!</a></td></tr><tr><td align="right">3&nbsp;</td><td><a href="essays.html" class="tocviewselflink" data-pltdoc="x">Fly, the unchained!</a></td></tr><tr><td align="right">4&nbsp;</td><td><a href="contraptions.html" class="tocviewlink" data-pltdoc="x">Roll, contraptions!</a></td></tr><tr><td align="right">5&nbsp;</td><td><a href="appendices.html" class="tocviewlink" data-pltdoc="x">Appendices</a></td></tr></table></div></div><div class="tocviewlist"><table cellspacing="0" cellpadding="0"><tr><td style="width: 1em;"><a href="javascript:void(0);" title="Expand/Collapse" class="tocviewtoggle" onclick="TocviewToggle(this,&quot;tocview_1&quot;);">&#9660;</a></td><td>3&nbsp;</td><td><a href="essays.html" class="tocviewlink" data-pltdoc="x">Fly, the unchained!</a></td></tr></table><div class="tocviewsublistbottom" style="display: block;" id="tocview_1"><table cellspacing="0" cellpadding="0"><tr><td align="right">3.1&nbsp;</td><td><a href="jj-2021.html" class="tocviewlink" data-pltdoc="x">Jokes from Josh, 2021</a></td></tr><tr><td align="right">3.2&nbsp;</td><td><a href="jj-2022.html" class="tocviewlink" data-pltdoc="x">Jokes from Josh, 2022</a></td></tr><tr><td align="right">3.3&nbsp;</td><td><a href="" class="tocviewselflink" data-pltdoc="x">&#24039;&#20811;&#21147;&#26408;&#26834;</a></td></tr><tr><td align="right">3.4&nbsp;</td><td><a href="sunny-daze.html" class="tocviewlink" data-pltdoc="x">Sunny Daze</a></td></tr><tr><td align="right">3.5&nbsp;</td><td><a href="interface.html" class="tocviewlink" data-pltdoc="x">Interface</a></td></tr><tr><td align="right">3.6&nbsp;</td><td><a href="unresolved-symbols.html" class="tocviewlink" data-pltdoc="x">Unresolved
Symbols</a></td></tr><tr><td align="right">3.7&nbsp;</td><td><a href="the-fist.html" class="tocviewlink" data-pltdoc="x">&#19968;&#25331;</a></td></tr></table></div></div></div></div><div class="maincolumn"><div class="main"><div class="versionbox"><span class="version">8.11</span></div><div class="navsettop"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;<span class="tocsettoggle">&nbsp;&nbsp;<a href="javascript:void(0);" title="show/hide table of contents" onclick="TocsetToggle();">contents</a></span></span><span class="navright">&nbsp;&nbsp;<a href="jj-2022.html" title="backward to &quot;3.2 Jokes from Josh, 2022&quot;" data-pltdoc="x" rel="prev">&larr; prev</a>&nbsp;&nbsp;<a href="essays.html" title="up to &quot;3 Fly, the unchained!&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="sunny-daze.html" title="forward to &quot;3.4 Sunny Daze&quot;" data-pltdoc="x" rel="next">next &rarr;</a></span>&nbsp;</div><h4>3.3<tt>&nbsp;</tt><a name="(part._chocolate-bar)"></a>&#24039;&#20811;&#21147;&#26408;&#26834;</h4><blockquote class="refpara"><blockquote class="refcolumn"><blockquote class="refcontent"><p>2024-08</p></blockquote></blockquote></blockquote><p><div class="SIntrapara">&#25918;&#23398;&#30340;&#36335;&#19978;&#65292;&#25105;&#40763;&#23376;&#22622;&#24471;&#21385;&#23475;&#12290;&#25105;&#24515;&#37324;&#24819;&#30528;&#65292;&#31967;&#31957;&#65292;&#40763;&#28814;&#21448;&#29359;&#20102;&#65292;&#38543;&#25163;&#25828;&#20102;&#19968;&#25226;&#40763;&#28053;&#65292;&#21457;&#29616;&#40763;&#23376;&#37324;&#22622;&#24471;&#31455;&#28982;&#26159;&#34013;&#33683;&#23665;&#33647;&#12290;&#26049;&#36793;&#19968;&#20301;&#21516;&#23398;&#32463;&#36807;&#65292;&#30475;&#20102;&#25105;&#19968;&#30524;&#65292;&#35828;&#65292;&#21710;&#21727;&#65292;&#21069;&#20004;&#22825;&#30340;&#23004;&#26411;&#25828;&#24178;&#20928;&#20102;&#65311;&#25105;&#19968;&#22836;&#38654;&#27700;&#65292;&#24515;&#24819;&#65292;&#20320;&#22823;&#29239;&#30340;&#25105;&#35748;&#35782;&#20320;&#21527;&#65311;&#24590;&#20040;&#25105;&#40763;&#23376;&#37324;&#27969;&#23004;&#26411;&#20320;&#20063;&#30693;&#36947;&#65311;</div><div class="SIntrapara"> &#26049;&#36793;&#30340;&#36842;&#22823;&#30475;&#25105;&#30097;&#24785;&#65292;&#23601;&#35828;&#65292;&#20320;&#40763;&#23376;&#37324;&#37027;&#28857;&#19996;&#35199;&#35841;&#19981;&#30693;&#36947;&#21602;&#65292;&#19978;&#27425;&#37027;&#21322;&#31435;&#26041;&#33609;&#33683;&#20912;&#28608;&#28107;&#28040;&#32791;&#23436;&#20102;&#27809;&#26377;&#21834;&#65311;&#25105;&#27491;&#24819;&#35828;&#8220;&#37027;&#26126;&#26126;&#26159;&#19968;&#30406;&#35199;&#29916;&#21619;&#30340;&#21834;&#65292;&#24403;&#26102;&#20320;&#36824;&#24448;&#19978;&#25746;&#23004;&#26411;&#65281;&#8221;&#65292;&#36716;&#30524;&#21448;&#24819;&#65292;&#8220;&#31639;&#20102;&#65292;&#20182;&#35201;&#21453;&#21676;&#19968;&#21475;&#35828;&#25746;&#23004;&#26411;&#30340;&#26159;&#25105;&#65292;&#25105;&#20063;&#30334;&#21475;&#33707;&#36776;&#12290;&#8221;</div><div class="SIntrapara"> &#36842;&#22823;&#32487;&#32493;&#35828;&#36947;&#65306;&#21548;&#27491;&#21513;&#35828;&#65292;&#21069;&#20960;&#22825;&#26377;&#20010;&#23478;&#20249;&#27604;&#20320;&#36824;&#22840;&#24352;&#65292;&#24324;&#20102;&#19968;&#21544;&#21322;&#24039;&#20811;&#21147;&#20986;&#26469;&#65292;&#21507;&#19981;&#23436;&#20063;&#25918;&#19981;&#19979;&#65292;&#22826;&#24808;&#20102;&#65281;</div><div class="SIntrapara"> &#25105;&#22238;&#21040;&#23478;&#65292;&#30475;&#21040;&#26612;&#25151;&#37324;&#29240;&#29240;&#38191;&#19979;&#30340;&#36793;&#35282;&#26009;&#65292;&#25214;&#20102;&#20960;&#26681;&#20809;&#28369;&#30340;&#26837;&#33394;&#26408;&#26465;&#65292;&#38543;&#25163;&#19968;&#25293;&#65292;&#32473;&#36842;&#22823;&#21644;&#27491;&#21513;&#20182;&#20204;&#21457;&#20102;&#36807;&#21435;&#65292;&#35828;&#65292;&#8220;&#24039;&#20811;&#21147;&#26377;&#20160;&#20040;&#38590;&#22788;&#29702;&#30340;&#65311;&#25105;&#24050;&#32463;&#24110;&#37027;&#23478;&#20249;&#38191;&#25104;&#26465;&#20102;&#12290;&#8221;</div><div class="SIntrapara"> &#21507;&#36807;&#21320;&#39277;&#65292;&#25105;&#27491;&#24819;&#19979;&#21320;&#36824;&#35201;&#19981;&#35201;&#21435;&#19978;&#23398;&#65292;&#24573;&#28982;&#25688;&#26143;&#21644;&#28034;&#36745;&#36305;&#21040;&#20102;&#25105;&#23478;&#65292;&#38382;&#25105;&#24039;&#20811;&#21147;&#26834;&#22312;&#21738;&#12290;&#25105;&#24102;&#20182;&#20204;&#21435;&#20102;&#26612;&#25151;&#12290;&#20182;&#20204;&#31934;&#25361;&#32454;&#36873;&#65292;&#36873;&#20013;&#20102;&#19968;&#20123;&#26408;&#26465;&#65292;&#26377;&#20123;&#36824;&#24102;&#30528;&#26641;&#30382;&#65292;&#25105;&#24515;&#24819;&#65292;&#20320;&#20204;&#36825;&#26159;&#21916;&#27426;&#20160;&#20040;&#21475;&#21619;&#30340;&#65311;</div><div class="SIntrapara"> &#20182;&#20204;&#21448;&#38382;&#25105;&#36825;&#20123;&#24039;&#20811;&#21147;&#26834;&#26159;&#24590;&#20040;&#20570;&#20986;&#26469;&#30340;&#12290;&#25105;&#35828;&#65292;&#20320;&#24819;&#23398;&#21834;&#65311;&#25105;&#24102;&#20320;&#21435;&#30475;&#21834;&#12290;&#25105;&#24102;&#20182;&#20204;&#26469;&#21040;&#20102;&#25105;&#29240;&#30340;&#24037;&#20316;&#22330;&#65292;&#29240;&#29240;&#36824;&#22312;&#38191;&#26408;&#22836;&#65292;&#36793;&#19978;&#26377;&#20960;&#25226;&#38386;&#32622;&#30340;&#38191;&#23376;&#12290;&#20182;&#20204;&#25343;&#30528;&#33258;&#24049;&#30340;&#26408;&#26465;&#65292;&#20945;&#21040;&#38191;&#23376;&#26049;&#36793;&#27604;&#21010;&#30528;&#65292;&#20223;&#20315;&#37027;&#24039;&#20811;&#21147;&#26834;&#26159;&#20182;&#20204;&#33258;&#24049;&#20570;&#20986;&#26469;&#30340;&#65292;&#33293;&#19981;&#24471;&#21507;&#65292;&#35201;&#30041;&#20316;&#27704;&#20037;&#30340;&#32426;&#24565;&#12290;</div><div class="SIntrapara"> &#25972;&#25972;&#19968;&#19979;&#21320;&#65292;&#20182;&#20204;&#23601;&#22312;&#37027;&#25226;&#29609;&#30528;&#33258;&#24049;&#30340;&#24039;&#20811;&#21147;&#26834;&#65292;&#30475;&#30528;&#25105;&#29240;&#38191;&#26408;&#22836;&#12290;&#25105;&#24819;&#30528;&#65292;&#23601;&#31639;&#25105;&#19981;&#21435;&#19978;&#23398;&#20102;&#65292;&#20320;&#20204;&#20063;&#19981;&#35201; outstay your welcome &#21568;&#65292;&#20294;&#21364;&#20063;&#24320;&#19981;&#20102;&#21475;&#12290;</div><div class="SIntrapara"> &#32456;&#20110;&#21040;&#20102;&#26202;&#39277;&#26102;&#38388;&#65292;&#25105;&#22992;&#22992;&#36807;&#26469;&#35828;&#65292;&#30041;&#20182;&#20204;&#22312;&#36825;&#21507;&#39277;&#21543;&#12290;&#20182;&#20457;&#38754;&#38706;&#21916;&#33394;&#65292;&#25105;&#19968;&#19979;&#26126;&#30333;&#20102;&#65292;&#36214;&#32039;&#23545;&#20182;&#20204;&#35828;&#65306;&#25105;&#20204;&#23478;&#27809;&#26377;&#24039;&#20811;&#21147;&#26834;&#65292;&#26202;&#39277;&#20063;&#19981;&#21507;&#24039;&#20811;&#21147;&#26834;&#65292;&#20320;&#20204;&#25343;&#30340;&#36825;&#20123;&#21482;&#26159;&#19968;&#20123;&#26408;&#26465;&#65292;&#36793;&#35282;&#26009;&#65281;&#20182;&#20457;&#20063;&#19981;&#21453;&#39539;&#27714;&#35777;&#65292;&#28385;&#33080;&#22833;&#26395;&#22320;&#24102;&#30528;&#26408;&#26465;&#31163;&#24320;&#20102;&#12290;</div><div class="SIntrapara"> &#20182;&#20204;&#31163;&#24320;&#21518;&#65292;&#25105;&#30340;&#23478;&#20154;&#24102;&#30528;&#19968;&#28857;&#24453;&#23458;&#19981;&#21608;&#30340;&#20869;&#30106;&#12290;&#25105;&#36319;&#20182;&#20204;&#35299;&#37322;&#35828;&#65292;&#20182;&#20204;&#35201;&#21507;&#24039;&#20811;&#21147;&#26834;&#65292;&#21681;&#20204;&#27809;&#26377;&#12290;&#25105;&#22992;&#22992;&#35828;&#65292;&#35201;&#19981;&#24324;&#20010;&#27833;&#26465;&#20945;&#21512;&#19968;&#19979;&#65311;&#19981;&#26159;&#36824;&#26377;&#21322;&#30406;&#35199;&#29916;&#21619;&#20912;&#28608;&#20940;&#21527;&#65311;&#25105;&#19981;&#32784;&#28902;&#22320;&#25671;&#20102;&#25671;&#22836;&#65292;&#30475;&#21040;&#29240;&#29240;&#33080;&#19978;&#20063;&#26377;&#19968;&#19997;&#38590;&#33394;&#65292;&#23601;&#21149;&#35299;&#36947;&#65306;</div><div class="SIntrapara"> &#35841;&#21448;&#33021;&#25226;&#26408;&#22836;&#38191;&#25104;&#24039;&#20811;&#21147;&#26834;&#21602;&#65311;&#26159;&#20182;&#20204;&#33258;&#24049;&#22826;&#35748;&#30495;&#22826;&#22068;&#39307;&#65292;&#38750;&#35201;&#25226;&#26408;&#26465;&#24403;&#24039;&#20811;&#21147;&#26834;&#30340;&#12290;</div><div class="SIntrapara">&lt;END&gt;</div></p><div class="navsetbottom"><span class="navleft"><div class="nosearchform"></div>&nbsp;&nbsp;<span class="tocsettoggle">&nbsp;&nbsp;<a href="javascript:void(0);" title="show/hide table of contents" onclick="TocsetToggle();">contents</a></span></span><span class="navright">&nbsp;&nbsp;<a href="jj-2022.html" title="backward to &quot;3.2 Jokes from Josh, 2022&quot;" data-pltdoc="x" rel="prev">&larr; prev</a>&nbsp;&nbsp;<a href="essays.html" title="up to &quot;3 Fly, the unchained!&quot;" data-pltdoc="x">up</a>&nbsp;&nbsp;<a href="sunny-daze.html" title="forward to &quot;3.4 Sunny Daze&quot;" data-pltdoc="x" rel="next">next &rarr;</a></span>&nbsp;</div></div></div><div id="contextindicator">&nbsp;</div></body></html>